Repository: 84000/data-translation-memory
Catalog: toh109-v4.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ག་ཡཱ་མགོའི་རི་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Gayāśīrṣa Hill

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།།
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པའི་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཡུན་རིང་པོ་མ་ལོན་པར་བཅོམ་ལྡན་འདས་རི་ག་ཡཱ་ན་ག་ཡཱ་མགོའི་མཆོད་རྟེན་ན། དགེ་སློང་སྟོང་དུ་ཚང་བའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་ཐམས་ཅད་ཀྱང་སྔོན་རལ་པ་ཅན་དུ་གྱུར་པ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པ་ཀུན་ཏུ་སྦྱོར་བ། ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་དུ་སོན་པ། དགྲ་བཅོམ་པ་ཤ་སྟག་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རབ་ཏུ་མང་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: Not long after attaining full awakening, the Bhagavat was residing at the shrine of Gayāśīrṣa on Gayā Hill together with a great saṅgha of bhikṣus numbering one thousand—all of them previously ascetics with matted hair, having done what had to be done, with their task accomplished, their burdens laid down, their own purpose attained, the fetters of existence extinguished, their minds freed through perfect knowledge, and the excellence of all powers of the mind perfected, and exclusively arhats—and a great many bodhisattva great beings.

source: དེ་ནས་བཅོམ་ལྡན་འདས་གཅིག་པུ་དབེན་པར་གཤེགས་ཏེ། ནང་དུ་ཡང་དག་བཞག་ནས་ཆོས་ཀྱི་དབྱིངས་ཉིད་ལ་བརྟགས་ཏེ། བདག་གིས་བྱང་ཆུབ་ནི་ཐོབ།
en: Then, alone, the Bhagavat went into isolation, settled himself inwardly, and examined the dharmadhātu, thinking, “I attained awakening.

source: བདག་གིས་ཡེ་ཤེས་ནི་ཁོང་དུ་ཆུད།
en: I realized gnosis.

source: བདག་གིས་བྱ་བ་ནི་བྱས།
en: I did what had to be done.

source: བདག་གིས་ཁུར་ནི་བོར།
en: I laid down my burden.

source: བདག་གིས་འཁོར་བའི་འབྲོག་དགོན་པ་ལས་ནི་རྒལ།
en: I crossed the wild forest of saṃsāra.

source: བདག་གིས་མ་རིག་པ་ནི་བསལ།
en: I eliminated ignorance.

source: བདག་གིས་རིག་པ་ནི་སྒྲུབ།
en: I accomplished knowledge.

source: བདག་གིས་ཟུག་རྔུ་ནི་ཕྱུང་།
en: I removed the thorn.

source: བདག་གི་སྲེད་པ་ནི་ཟད།
en: I extinguished craving.

source: བདག་གིས་ཆོས་ཀྱི་གྲུ་ནི་སྦྱར།
en: I built the ship of Dharma.

source: བདག་གིས་ཆོས་ཀྱི་རྔ་ནི་བརྡུངས།
en: I beat the drum of Dharma.

source: བདག་གིས་ཆོས་ཀྱི་དུང་ནི་བུས།
en: I blew the conch of Dharma.

source: བདག་གིས་ཆོས་ཀྱི་རྒྱལ་མཚན་ནི་བསྒྲེང་།
en: I raised the banner of Dharma.

source: བདག་གིས་འཁོར་བའི་ལུགས་ནི་བཟློག།
en: I overcame the way of saṃsāra.

source: བདག་གིས་ཆོས་ཀྱི་ལུགས་ནི་བསྙད།
en: I described the way of Dharma.

source: བདག་གིས་ལམ་ངན་པ་ནི་བཅད།
en: I cut off unfit paths.

source: བདག་གིས་ལམ་ནི་ཡང་དག་པར་བསྟན།
en: I demonstrated the path.

source: བདག་གིས་ཞིང་ངན་པ་དག་ནི་རྣམ་པར་བཟློག།
en: I rejected barren fields.

source: བདག་གིས་བསོད་ནམས་ཀྱི་ཞིང་དག་ནི་ཡང་དག་པར་བསྟན་ན།
en: I demonstrated the fields of merit. “

source: འདི་ལྟར་བདག་གིས་བྱང་ཆུབ་དེ་ཇི་ལྟར་ཁོང་དུ་ཆུད་པ་དང་།
en: Now, how did I realize awakening?

source: གང་གིས་ཁོང་དུ་ཆུད་པ་དང་།
en: By what means did I realize it?

source: སུས་ཁོང་དུ་ཆུད་པར་འགྱུར་བའི་ཆོས་དེ་ལ་ངེས་པར་བརྟག་པར་བྱ་སྟེ།
en: Who realized it? These things ought to be examined. “

source: ཅི་ལུས་ཀྱིས་ཁོང་དུ་ཆུད་དམ།
en: Was it realized by the body?

source: འོན་ཏེ་སེམས་ཀྱིས་ཁོང་དུ་ཆུད།
en: Or was it realized by the mind? “

source: གལ་ཏེ་ལུས་ཀྱིས་ཁོང་དུ་ཆུད་དུ་ནི་ལུས་ནི་བེམས་པོ། གཡོ་བ་མེད་པ་དང་། རྩྭ་དང་། ཤིང་དང་། རྩིག་པ་དང་། བོང་བ་དང་། མིག་ཡོར་ལྟ་བུ་སྟེ། སེམས་མེད་པ། འབྱུང་བ་ཆེན་པོ་བཞི་ལས་གྱུར་པ། ཕ་མའི་མི་གཙང་བ་ལས་བྱུང་བ་དང་། མི་རྟག་པ་དང་། རྟག་ཏུ་བསྐུ་བ་དང་། བཀྲུ་བ་དང་། མཉེ་དགོས་པ་དང་། འཇིག་པ་དང་། རྣམ་པར་འགྱེས་པ་དང་། རྣམ་པར་འཇིག་པའི་ཆོས་ཅན་ནོ། །
en: With respect to its being realized by the body, the body is inert matter, motionless—like grass, a tree, a wall, a clod of earth, and a visual aberration—mindless, derived from the four elements, arisen from the impurities of one’s parents, impermanent, and in need of constant anointing, washing, and massage; it has the properties of perishing, breaking apart, and being destroyed. “

source: སེམས་ནི་སྒྱུ་མ་དང་མཚུངས་པ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ། གནས་མེད་པ། མཚན་ཉིད་མེད་པ། དངོས་པོ་མེད་པ། བླ་གབ་མེད་པའོ། །
en: The mind is like an illusion, dependently originated, without a basis, without characteristics, without substance, and in an open state. “

source: བྱང་ཆུབ་ནི་མིང་ཙམ་ཐ་སྙད་ཙམ་སྟེ། སྒྲ་སྐད་མེད་པ། དཔྱད་དུ་མེད་པ། གྲུབ་པ་མེད་པ། རྒྱུ་བ་མེད་པ། འཇུག་པ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པ། གདགས་པར་བྱ་བ་མ་ཡིན་པ།
en: Awakening is merely a name, merely a convention, without language, not analyzable, not established, without movement, without engagement, without cognition, and not to be designated.

source: འོང་བ་དང་འགྲོ་བ་ལས་ཡང་དག་པར་འདས་པ། གདགས་པ་ལས་ཡང་དག་པར་འདས་པ། ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདས་པ།
en: It has transcended coming and going, transcended designation, and transcended the three realms.

source: མ་མཐོང་བ། མ་ཐོས་པ། བྱེ་བྲག་མ་ཕྱེད་པ། གཞི་མེད་པ། དམིགས་པ་མེད་པ། རྒྱུ་བ་མེད་པ། སྤྲོས་པ་མེད་པ། འཇུག་པ་མེད་པ། བརྟག་ཏུ་མེད་པ།
en: It is unseen, unheard, undifferentiated, without foundation, unobservable, without movement, without elaboration, without engagement, and not examinable.

source: དཔག་ཏུ་མེད་པ། བསྟན་དུ་མེད་པ། སྒྲ་མེད་པ། ཡི་གེ་མེད་པ། ཚིག་གི་ལམ་མེད་པའོ།།
en: It is immeasurable, indemonstrable, without words, without syllables, without verbal expression. “

source: དེ་ལྟར་ན་སུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: Thus, who will attain full awakening?

source: གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: By what means will one attain full awakening?

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་ནི་གང་ཡིན།
en: What is it to be fully awakened?

source: ཆོས་འདི་དག་ཐམས་ཅད་ནི་མིང་ཙམ། བཏགས་པ་ཙམ། བརྡ་ཙམ། ཐ་སྙད་ཙམ་སྟེ། བརྟགས་པ། ཡོངས་སུ་བརྟགས་པ།
en: All these things are mere names, merely designated, mere signs, mere conventions, conceptualized and imagined.

source: མ་བྱུང་བ། བྱུང་བ་མེད་པ། རྫས་མ་ཡིན་པ། རྫས་མེད་པ། ལེན་པ་མེད་པ། བསྟན་དུ་མེད་པ། མངོན་པར་ཆགས་པ་མེད་པ་ཡིན་ཏེ།
en: They are not arisen, without arising, not a substance, without substance, without appropriation, indemonstrable, and without attachment. “

source: དེ་ལ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་སུ་ཡང་མེད།
en: In that regard, nobody will attain full awakening.

source: ཅིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡང་མེད།
en: There is no means by which one will attain full awakening.

source: མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་ཅི་ཡང་མེད།
en: There is nothing whatsoever to be fully awakened.

source: རྣམ་པ་གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བ་ཡང་མེད་དེ།
en: There is no means whatsoever by which to be fully awakened.

source: འདི་ལ་གང་དེ་ལྟར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དེའི་ཕྱིར། བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཞེས་བྱ་སྟེ། དེ་ལ་བྱང་ཆུབ་ནི་འགྱུར་བ་མེད་པ། མི་འགྱུར་བ། མཚན་ཉིད་མེད་པའོ་སྙམ་མོ།།
en: Because of attaining full awakening in that way, it is called attaining full awakening, as in that regard awakening is immutable, unchanging, and without characteristics.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།། བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་ཀྱི་མཚན་ཉིད་དེ་ལྟ་བུ་ལགས་ན། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་ཇི་ལྟར་བྱང་ཆུབ་ཀྱི་སླད་དུ་འཇུག་པར་བགྱི།
en: Then, the ever-youthful Mañjuśrī asked the Bhagavat, “Bhagavat, if the characteristics of awakening are such, Bhagavat, how should a son of good family or a daughter of good family advance toward awakening?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱང་ཆུབ་དེ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་ཕྱིར་འཇུག་པར་བྱའོ།།
en: Mañjuśrī,” replied the Bhagavat, “a bodhisattva should advance toward awakening in accordance with how that awakening is.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཇི་ལྟར་རབ་ཏུ་འཚལ་བར་འགྱུར།
en: Mañjuśrī asked, “Bhagavat, how should one seek awakening?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱང་ཆུབ་ནི་ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདས་པ། ཐ་སྙད་ལས་ཡང་དག་པར་འདས་པ། ཡི་གེའི་སྒྲ་སྐད་ལས་ཡང་དག་པར་འདས་པ། སྒྲ་ལས་ཡང་དག་པར་འདས་པ།
en: Mañjuśrī,” replied the Bhagavat, “awakening transcends the three realms, transcends conventions, transcends the language of syllables, and transcends words.

source: འཇུག་པ་མེད་པ། གཟོད་མ་ཉིད་ནས་འཇུག་པ་མེད་པའོ།།
en: It is without engagement—without engagement from the very beginning.

source: འཇམ་དཔལ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་འཇུག་པ་ལ་ཡང་དག་པར་འདས་པ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་འཇུག་པར་བྱའོ།།
en: Therefore, Mañjuśrī, bodhisattvas who have transcended engagement should advance toward awakening. “

source: འཇམ་དཔལ་འཇུག་པ་མེད་པའི་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement that is without engagement is engagement in awakening.

source: འཇམ་དཔལ་དངོས་པོ་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the absence of substance is engagement in awakening.

source: འཇམ་དཔལ་བླ་གབ་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in an open state is engagement in awakening.

source: འཇམ་དཔལ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the nature of the dharmadhātu is engagement in awakening.

source: འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the absence of fixation on all phenomena is engagement in awakening.

source: འཇམ་དཔལ་ཡང་དག་པའི་མཐའ་དབྱེར་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the indivisible very limit of reality is engagement in awakening.

source: འཇམ་དཔལ་དོར་བ་མེད་པ་དང་། གཞག་པ་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the absence of elimination and the absence of addition is engagement in awakening.

source: འཇམ་དཔལ་ཐ་དད་པ་མ་ཡིན་པ་དང་། ཐ་དད་པ་མེད་པ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the non-different and the absence of difference is engagement in awakening.

source: འཇམ་དཔལ་སོ་སོ་ཡང་དག་པར་རིག་པའི་མིག་ཡོར་དང་། བྲག་ཅ་དང་། ནམ་མཁའ་དང་། ཆུ་ཟླ་དང་། སྨིག་རྒྱུ་ལ་འཇུག་པ་ནི་བྱང་ཆུབ་ལ་འཇུག་པའོ།།
en: Mañjuśrī, engagement in the properly understood visual aberration, echo, space, reflection of the moon in water, and mirage is engagement in awakening.”

source: དེ་ནས་ལྷའི་བུ་ཟླ་བ་དྲི་མ་མེད་པའི་གཟི་བརྗིད་འོད་ཟེར་གྱི་འོད་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་རྩོམ་པ་ནི་ཅི།
en: Then, the god Light of the Magnificent Light Rays of the Stainless Moon asked the ever-youthful Mañjuśrī, “Mañjuśrī, what is the beginning of bodhisattvas’ conduct?

source: གནས་ནི་གང་།
en: What is its basis?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པའི་རྩོམ་པ་ནི་སྙིང་རྗེ་ཆེན་པོའོ།།
en: Divine son,” replied Mañjuśrī, “the beginning of bodhisattvas’ conduct is great compassion.

source: གནས་ནི་སེམས་ཅན་ནོ།།
en: Its basis is sentient beings.”

source: སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ཅིས་བསྡུས།
en: He asked, “Mañjuśrī, by what is the great compassion of bodhisattvas encompassed?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་ནི་གཡོ་མེད་པས་བསྡུས་སོ།། སྨྲས་པ།
en: Divine son,” replied Mañjuśrī, “the great compassion of bodhisattvas is encompassed by immovability.”

source: འཇམ་དཔལ་གཡོ་མེད་པ་ཅིས་བསྡུས།
en: He asked, “Mañjuśrī, by what is immovability encompassed?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཡོ་མེད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པའི་སེམས་ཀྱིས་བསྡུས་པའོ།།
en: Divine son,” replied Mañjuśrī, “the immovability of bodhisattvas is encompassed by the mind that is impartial toward all sentient beings.”

source: སྨྲས་པ། འཇམ་དཔལ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པའི་སེམས་ཅིས་བསྡུས།
en: He asked, “Mañjuśrī, by what is the mind that is impartial toward all sentient beings encompassed?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙོམས་པའི་སེམས་ནི་ཐ་དད་པ་མ་ཡིན་པ་དང་། ཐ་དད་པ་མེད་པའི་སྤྱོད་པས་བསྡུས་སོ།།
en: Divine son,” replied Mañjuśrī, “the mind of bodhisattvas that is impartial toward all sentient beings is encompassed by the conduct that is non-different and without difference.”

source: སྨྲས་པ། འཇམ་དཔལ་ཐ་དད་པ་མ་ཡིན་པ་དང་། ཐ་དད་པ་མེད་པའི་སྤྱོད་པ་ཅིས་བསྡུས།
en: He asked, “Mañjuśrī, by what is the conduct that is non-different and without difference encompassed?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐ་དད་པ་མ་ཡིན་པ་དང་། ཐ་དད་པ་མེད་པའི་སྤྱོད་པ་ནི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པས་བསྡུས་པའོ།།
en: Divine son,” replied Mañjuśrī, “the conduct that is non-different and without difference is encompassed by the intention and the noblest intention.”

source: སྨྲས་པ། འཇམ་དཔལ་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what do the intention and the noblest intention arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་ནི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the intention and the noblest intention of bodhisattvas arise for the sake of the mind of awakening.”

source: སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་ཀྱི་སེམས་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what does the mind of awakening arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the mind of awakening of bodhisattvas arises for the sake of the six perfections.”

source: སྨྲས་པ། འཇམ་དཔལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what do the six perfections arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ནི་ཐབས་དང་ཤེས་རབ་གཉིས་ཀྱི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the six perfections of bodhisattvas arise for the sake of the two: method and wisdom.”

source: སྨྲས་པ། འཇམ་དཔལ་ཐབས་དང་ཤེས་རབ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what do method and wisdom arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཐབས་དང་ཤེས་རབ་ནི་བག་ཡོད་པའི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the method and wisdom of bodhisattvas arise for the sake of heedfulness.”

source: སྨྲས་པ། འཇམ་དཔལ་བག་ཡོད་པ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what does heedfulness arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བག་ཡོད་པ་ནི་ལེགས་པར་སྤྱོད་པ་རྣམ་པ་གསུམ་གྱི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the heedfulness of bodhisattvas arises for the sake of the three kinds of good conduct.”

source: སྨྲས་པ། འཇམ་དཔལ་ལེགས་པར་སྤྱོད་པ་རྣམ་པ་གསུམ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what do the three kinds of good conduct arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལེགས་པར་སྤྱོད་པ་རྣམ་པ་གསུམ་ནི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the three kinds of good conduct of bodhisattvas arise for the sake of the ten virtuous courses of action.”

source: སྨྲས་པ། འཇམ་དཔལ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what do the ten virtuous courses of action arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ནི་སྡོམ་པའི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the ten virtuous courses of action of bodhisattvas arise for the sake of restraint.”

source: སྨྲས་པ། འཇམ་དཔལ་སྡོམ་པ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what does restraint arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྡོམ་པ་ནི་ཚུལ་བཞིན་ཡིད་ལ་བྱ་བའི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the restraint of bodhisattvas arises for the sake of proper attention.”

source: སྨྲས་པ། འཇམ་དཔལ་ཚུལ་བཞིན་ཡིད་ལ་བྱ་བ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what does proper attention arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚུལ་བཞིན་ཡིད་ལ་བྱ་བ་ནི་སོ་སོར་རྟོག་པའི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the proper attention of bodhisattvas arises for the sake of investigation.”

source: སྨྲས་པ། འཇམ་དཔལ་སོ་སོར་རྟོག་པ་ཅིའི་ཕྱིར་བྱུང་།
en: He asked, “Mañjuśrī, for the sake of what does investigation arise?” “

source: སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སོ་སོར་རྟོག་པ་ནི་དྲན་པའི་ཕྱིར་བྱུང་ངོ།།
en: Divine son, the investigation of bodhisattvas arises for the sake of mindfulness.”

source: སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དག་རྒྱུར་བསྡུ་བ་དང་། འབྲས་བུར་བསྡུ་བར་འགྱུར་བ་དུ།
en: He asked, “Mañjuśrī, how many kinds of the bodhisattvas’ giving rise to the mind of awakening are included among causes and included among results?” “

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་དག་རྒྱུར་བསྡུ་བ་དང་། འབྲས་བུར་བསྡུ་བར་འགྱུར་བ་ནི་བཞི་པོ་འདི་དག་སྟེ།
en: Divine son,” replied Mañjuśrī, “these four are the kinds of the bodhisattvas’ giving rise to the mind of awakening that are included among causes and included among results.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: དང་པོ་སེམས་བསྐྱེད་པ་དང་། སྤྱོད་པ་དང་འབྲེལ་པ་དང་། ཕྱིར་མི་ལྡོག་པ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའོ།།
en: They are the initial giving rise to the mind of awakening, that which is associated with conduct, the irreversible, and that which is separated from the goal by one birth.

source: དེ་ལ་དང་པོ་སེམས་བསྐྱེད་པ་ནི་སྤྱོད་པ་དང་འབྲེལ་པའི་རྒྱུར་བལྟའོ།། སྤྱོད་པ་དང་འབྲེལ་པ་ནི་ཕྱིར་མི་ལྡོག་པའི་རྒྱུར་བལྟའོ།། ཕྱིར་མི་ལྡོག་པ་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་རྒྱུར་བལྟའོ།། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་ནི་འབྲས་བུ་དང་འབྲེལ་པའི་རྒྱུར་བལྟའོ།།
en: With respect to these, the initial giving rise to the mind of awakening should be viewed as the cause of the giving rise to the mind of awakening that is associated with conduct; that associated with conduct should be viewed as the cause of the irreversible; the irreversible should be viewed as the cause of that which is separated from the goal by one birth; the giving rise to the mind of awakening that is separated from the goal by one birth should be viewed as the cause that is associated with the result. “

source: ལྷའི་བུ་གཞན་ཡང་དཔེར་ན་ས་བོན་བཏབ་པ་དེ་ལྟ་བུར་ནི་དང་པོ་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as like the planting of a seed.

source: དཔེར་ན་ས་བོན་ལས་མྱུ་གུ་མངོན་པར་འགྲུབ་པ་དེ་ལྟ་བུར་ནི་སྤྱོད་པ་དང་འབྲེལ་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is associated with conduct should be viewed as like the forming of a sprout from a seed.

source: དཔེར་ན་སྡོང་བུ་དང་། འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་འབྱུང་བ་དེ་ལྟ་བུར་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The irreversible giving rise to the mind of awakening should be viewed as like the arising of a stem, leaves, flowers, and fruits.

source: དཔེར་ན་འབྲས་བུ་ཡོངས་སུ་སྨིན་པ་དེ་ལྟ་བུར་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is separated from the goal by one birth should be viewed as like the ripening of fruits. “

source: ལྷའི་བུ་གཞན་ཡང་དཔེར་ན་ཤིང་རྟ་མཁན་ཤིང་བསྡུ་བ་ཤེས་པ་དེ་ལྟ་བུར་ནི་དང་པོ་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as like a chariot maker’s knowledge of how to gather wood.

source: དཔེར་ན་ཤིང་རྟའི་ཡན་ལག་ཡོངས་སུ་སྦྱང་བ་ཤེས་པ་དེ་ལྟ་བུར་ནི་སྤྱོད་པ་དང་འབྲེལ་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is associated with conduct should be viewed as like knowing how to construct the parts of a chariot.

source: དཔེར་ན་ཤིང་རྟ་ཡན་ལག་སྦྱོར་བ་ཤེས་པ་དེ་ལྟ་བུར་ནི་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The irreversible giving rise to the mind of awakening should be viewed as like knowing how to put together the parts of a chariot.

source: དཔེར་ན་ཁལ་དགལ་བ་ཤེས་པ་དེ་ལྟ་བུར་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།
en: The giving rise to the mind of awakening that is separated from the goal by one birth should be viewed as like knowing how to load packs onto a chariot. “

source: ལྷའི་བུ་གཞན་ཡང་ཟླ་བ་ཚེས་པའི་དཀྱིལ་འཁོར་མངོན་པར་འགྲུབ་པ་དེ་ལྟ་བུར་ནི་དང་པོ་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as like the forming of the new moon’s orb.

source: དཔེར་ན་ཚེས་ལྔ་དང་། དྲུག་དང་། བདུན་གྱི་ནུབ་མོ་ཟླ་བའི་དཀྱིལ་འཁོར་ཤར་བ་དེ་ལྟ་བུར་ནི་སྤྱོད་པ་དང་འབྲེལ་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is associated with conduct should be viewed as like the appearance of the moon’s orb on the nights of the fifth, sixth, and seventh days.

source: དཔེར་ན་ཚེས་བཅུའི་ནུབ་མོ་ཟླ་བའི་དཀྱིལ་འཁོར་ཤར་བ་དེ་ལྟ་བུར་ནི་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The irreversible giving rise to the mind of awakening should be viewed as like the appearance of the moon’s orb on the night of the tenth day.

source: དཔེར་ན་ཚེས་བཅུ་བཞིའི་ནུབ་མོ་ཟླ་བའི་དཀྱིལ་འཁོར་ཤར་བ་དེ་ལྟ་བུར་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is separated from the goal by one birth should be viewed as like the appearance of the moon’s orb on the night of the fourteenth day.

source: དཔེར་ན་ཚེས་བཅྭ་ལྔའི་ནུབ་མོ་ཟླ་བའི་དཀྱིལ་འཁོར་ཤར་བ་དེ་ལྟ་བུར་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བལྟའོ།།
en: The gnosis of the tathāgata should be viewed as like the appearance of the moon’s orb on the night of the fifteenth day. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་ཉན་ཐོས་ཀྱི་ས་ལས་ཡང་དག་པར་འདའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening surpasses the śrāvaka’s level.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་རང་སངས་རྒྱས་ཀྱི་ས་ལས་ཡང་དག་པར་འདའོ།།
en: The second giving rise to the mind of awakening surpasses the pratyekabuddha’s level.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་མ་ངེས་པའི་ས་ལས་ཡང་དག་པར་འདའོ།།
en: The third giving rise to the mind of awakening surpasses the uncertain level.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་ངེས་པའི་ཕུང་པོ་ལ་གནས་སོ།།
en: The fourth giving rise to the mind of awakening dwells in the domain of certainty. “

source: ལྷའི་བུ་གཞན་ཡང་དང་པོ་སེམས་བསྐྱེད་པ་ནི་ཡི་གེའི་ཕྱི་མོ་འཛིན་པའི་ཚུལ་དུ་བལྟའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening should be viewed as being like learning the alphabet.

source: དཔེར་ན་རྣམ་པར་དབྱེ་བ་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཤེས་པ་དེ་ལྟ་བུར་ནི་སྤྱོད་པ་དང་འབྲེལ་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is associated with conduct should be viewed as like knowing how to distinguish the declensions.

source: དཔེར་ན་གྲངས་དང་། རྩིས་དང་། ཤོད་དགོད་པ་དེ་ལྟ་བུར་ནི་ཕྱིར་མི་ལྡོག་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The irreversible giving rise to the mind of awakening should be viewed as like knowing reckoning, calculation, and arithmetic.

source: དཔེར་ན་བསྟན་བཅོས་རྣམས་ཁོང་དུ་ཆུད་པ་དེ་ལྟ་བུར་ནི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་སེམས་བསྐྱེད་པ་བལྟའོ།།
en: The giving rise to the mind of awakening that is separated from the goal by one birth should be viewed as like mastering the treatises. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་རྒྱུར་འབྲེལ་པ་འོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening is related to the cause.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་ཡེ་ཤེས་དང་འབྲེལ་པ་འོ།།
en: The second giving rise to the mind of awakening is associated with gnosis.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་སྤོང་བ་དང་འབྲེལ་པ་འོ།།
en: The third giving rise to the mind of awakening is associated with abandonment.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་འབྲས་བུ་དང་འབྲེལ་པ་འོ།།
en: The fourth giving rise to the mind of awakening is associated with the result. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་རྒྱུས་བསྡུས་པའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening is encompassed by the cause.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་ཡེ་ཤེས་ཀྱིས་བསྡུས་པའོ།།
en: The second giving rise to the mind of awakening is encompassed by gnosis.

source: སེམས་བསྐྱེད་པ་གསུམ་པ་ནི་སྤོང་བས་བསྡུས་པའོ།།
en: The third giving rise to the mind of awakening is encompassed by abandonment.

source: སེམས་བསྐྱེད་པ་བཞི་པ་ནི་འབྲས་བུས་བསྡུས་པའོ།།
en: The fourth giving rise to the mind of awakening is encompassed by the result. “

source: ལྷའི་བུ་གཞན་ཡང་སེམས་བསྐྱེད་པ་དང་པོ་ནི་རྒྱུ་ལས་ཡང་དག་པར་བྱུང་བའོ།།
en: Furthermore, divine son, the initial giving rise to the mind of awakening arises from the cause.

source: སེམས་བསྐྱེད་པ་གཉིས་པ་ནི་ཡེ་ཤེས་ལས་ཡང་དག་པར་བྱུང་བའོ།།
en: The second giving rise to the mind of awakening arises from gnosis.
